/**
  2014-12-13
  0. 排序算法
    - 基础: 遍历/交换元素/反转数组/随机/内置 sort 方法
    - 归并排序
    - 插入排序
    - 快速排序    
    - 其他 - 堆排序, 基数排序, 桶排序.
    扩展: 
    使用递归方法遍历数组
  1. 浏览器插件 - 搜索引擎(一键到so.com)
    - 不在搜索引擎页面时, 打开 so.com
    - 在 so.com 域名下时, 不做处理.
    - 在其他搜索引擎页面时, 以同样的词, 在 so.com 搜索
    - 分析各家引擎的 keyword 对应的 KEY
  2. Canvas 基础
    - 作业: 五角星
  其他: 熟悉 CSS3
    - 居中方法 vw/vh/flex/box
    - [       xxxx |--| xxxx       ]
  2014-12-14
  * 0. jQuery 插件
  * 1. 如何更好的写代码
  2. 事件系统 - 消息通知
  3. Tab 切换
  * 4. 下载链接提取
  5. 二维码
  * 6. 切换搜索引擎
*/